app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all.reverse

SELECT "blogs".* FROM "blogs"
---
  def show
    @blogs = Blog.all

INSERT INTO "blogs" ("categories", "created_at", "naslov", "opis", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "naslov" = $1, "updated_at" = $2 WHERE "blogs"."id" = 9  [["naslov", "Copy paste form stackoverflow"], ["updated_at", Mon, 14 Oct 2013 18:12:40 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)