app/controllers/domov_controller.rb

  def blogs
  	@blogs = Blog.last(10).reverse
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT 10